/* automatically generated by rust-bindgen 0.69.4 */

pub use imgui_sys::*;
pub type time_t = libc::time_t;
pub type tm = libc::tm;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_const_charPtr {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_ImVector_const_charPtr() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_const_charPtr> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_const_charPtr>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_const_charPtr))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_const_charPtr>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_const_charPtr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_const_charPtr),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_const_charPtr),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_const_charPtr),
            "::",
            stringify!(Data)
        )
    );
}
pub type ImS8 = ::std::os::raw::c_schar;
pub type ImU8 = ::std::os::raw::c_uchar;
pub type ImS16 = ::std::os::raw::c_short;
pub type ImU16 = ::std::os::raw::c_ushort;
pub type ImS32 = ::std::os::raw::c_int;
pub type ImU32 = ::std::os::raw::c_uint;
pub type ImS64 = ::std::os::raw::c_longlong;
pub type ImU64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImWchar {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImWchar,
}
#[test]
fn bindgen_test_layout_ImVector_ImWchar() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImWchar> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImWchar>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImWchar))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImWchar>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImWchar))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImWchar),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImWchar),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImWchar),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiTextRange {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiTextRange,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiTextRange() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiTextRange> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiTextRange>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiTextRange))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiTextRange>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiTextRange))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTextRange),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTextRange),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTextRange),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_char {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_ImVector_char() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_char> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_char>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_char))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_char>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_char))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_char),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_char),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_char),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiStoragePair {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiStoragePair,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiStoragePair() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiStoragePair> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiStoragePair>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiStoragePair))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiStoragePair>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiStoragePair))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiStoragePair),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiStoragePair),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiStoragePair),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImDrawCmd {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImDrawCmd,
}
#[test]
fn bindgen_test_layout_ImVector_ImDrawCmd() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImDrawCmd> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImDrawCmd>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImDrawCmd))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImDrawCmd>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImDrawCmd))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImDrawCmd),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImDrawCmd),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImDrawCmd),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImDrawIdx {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImDrawIdx,
}
#[test]
fn bindgen_test_layout_ImVector_ImDrawIdx() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImDrawIdx> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImDrawIdx>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImDrawIdx))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImDrawIdx>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImDrawIdx))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImDrawIdx),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImDrawIdx),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImDrawIdx),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImDrawChannel {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImDrawChannel,
}
#[test]
fn bindgen_test_layout_ImVector_ImDrawChannel() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImDrawChannel> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImDrawChannel>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImDrawChannel))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImDrawChannel>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImDrawChannel))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImDrawChannel),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImDrawChannel),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImDrawChannel),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImDrawVert {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImDrawVert,
}
#[test]
fn bindgen_test_layout_ImVector_ImDrawVert() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImDrawVert> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImDrawVert>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImDrawVert))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImDrawVert>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImDrawVert))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImDrawVert),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImDrawVert),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImDrawVert),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImVec4 {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImVec4,
}
#[test]
fn bindgen_test_layout_ImVector_ImVec4() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImVec4> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImVec4>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImVec4))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImVec4>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImVec4))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImVec4),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImVec4),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImVec4),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImTextureID {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImTextureID,
}
#[test]
fn bindgen_test_layout_ImVector_ImTextureID() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImTextureID> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImTextureID>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImTextureID))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImTextureID>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImTextureID))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImTextureID),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImTextureID),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImTextureID),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImVec2 {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImVec2,
}
#[test]
fn bindgen_test_layout_ImVector_ImVec2() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImVec2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImVec2>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImVec2))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImVec2>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImVec2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImVec2),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImVec2),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImVec2),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImU32 {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImU32,
}
#[test]
fn bindgen_test_layout_ImVector_ImU32() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImU32> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImU32>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImU32))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImU32>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImU32))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImU32),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImU32),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImU32),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImFontPtr {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut *mut ImFont,
}
#[test]
fn bindgen_test_layout_ImVector_ImFontPtr() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImFontPtr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImFontPtr>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImFontPtr))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImFontPtr>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImFontPtr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImFontPtr),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImFontPtr),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImFontPtr),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImFontAtlasCustomRect {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImFontAtlasCustomRect,
}
#[test]
fn bindgen_test_layout_ImVector_ImFontAtlasCustomRect() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImFontAtlasCustomRect> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImFontAtlasCustomRect>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImFontAtlasCustomRect))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImFontAtlasCustomRect>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImFontAtlasCustomRect))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImFontAtlasCustomRect),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImFontAtlasCustomRect),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImFontAtlasCustomRect),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImFontConfig {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImFontConfig,
}
#[test]
fn bindgen_test_layout_ImVector_ImFontConfig() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImFontConfig> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImFontConfig>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImFontConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImFontConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImFontConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImFontConfig),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImFontConfig),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImFontConfig),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_float {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut f32,
}
#[test]
fn bindgen_test_layout_ImVector_float() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_float> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_float>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_float))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_float>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_float))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_float),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_float),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_float),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImFontGlyph {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImFontGlyph,
}
#[test]
fn bindgen_test_layout_ImVector_ImFontGlyph() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImFontGlyph> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImFontGlyph>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImFontGlyph))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImFontGlyph>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImFontGlyph))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImFontGlyph),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImFontGlyph),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImFontGlyph),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiPlatformMonitor {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiPlatformMonitor,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiPlatformMonitor() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiPlatformMonitor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiPlatformMonitor>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiPlatformMonitor))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiPlatformMonitor>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiPlatformMonitor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiPlatformMonitor),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiPlatformMonitor),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiPlatformMonitor),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiViewportPtr {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut *mut ImGuiViewport,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiViewportPtr() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiViewportPtr> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiViewportPtr>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiViewportPtr))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiViewportPtr>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiViewportPtr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiViewportPtr),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiViewportPtr),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiViewportPtr),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_int {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ImVector_int() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_int> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_int>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_int))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_int>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_int))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_int),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_int),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_int),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImDrawListPtr {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut *mut ImDrawList,
}
#[test]
fn bindgen_test_layout_ImVector_ImDrawListPtr() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImDrawListPtr> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImDrawListPtr>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImDrawListPtr))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImDrawListPtr>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImDrawListPtr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImDrawListPtr),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImDrawListPtr),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImDrawListPtr),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiKeyRoutingData {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiKeyRoutingData,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiKeyRoutingData() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiKeyRoutingData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiKeyRoutingData>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiKeyRoutingData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiKeyRoutingData>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiKeyRoutingData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiKeyRoutingData),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiKeyRoutingData),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiKeyRoutingData),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiListClipperRange {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiListClipperRange,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiListClipperRange() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiListClipperRange> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiListClipperRange>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiListClipperRange))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiListClipperRange>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiListClipperRange))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiListClipperRange),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiListClipperRange),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiListClipperRange),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiOldColumnData {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiOldColumnData,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiOldColumnData() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiOldColumnData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiOldColumnData>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiOldColumnData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiOldColumnData>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiOldColumnData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiOldColumnData),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiOldColumnData),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiOldColumnData),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiWindowPtr {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut *mut ImGuiWindow,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiWindowPtr() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiWindowPtr> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiWindowPtr>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiWindowPtr))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiWindowPtr>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiWindowPtr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiWindowPtr),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiWindowPtr),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiWindowPtr),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiDockRequest {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiDockRequest,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiDockRequest() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiDockRequest> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiDockRequest>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiDockRequest))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiDockRequest>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiDockRequest))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiDockRequest),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiDockRequest),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiDockRequest),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiDockNodeSettings {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiDockNodeSettings,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiDockNodeSettings() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiDockNodeSettings> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiDockNodeSettings>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiDockNodeSettings))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiDockNodeSettings>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiDockNodeSettings))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiDockNodeSettings),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiDockNodeSettings),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiDockNodeSettings),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiStackLevelInfo {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiStackLevelInfo,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiStackLevelInfo() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiStackLevelInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiStackLevelInfo>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiStackLevelInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiStackLevelInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiStackLevelInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiStackLevelInfo),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiStackLevelInfo),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiStackLevelInfo),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiInputEvent {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiInputEvent,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiInputEvent() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiInputEvent> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiInputEvent>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiInputEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiInputEvent>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiInputEvent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiInputEvent),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiInputEvent),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiInputEvent),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiWindowStackData {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiWindowStackData,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiWindowStackData() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiWindowStackData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiWindowStackData>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiWindowStackData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiWindowStackData>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiWindowStackData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiWindowStackData),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiWindowStackData),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiWindowStackData),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiColorMod {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiColorMod,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiColorMod() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiColorMod> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiColorMod>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiColorMod))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiColorMod>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiColorMod))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiColorMod),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiColorMod),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiColorMod),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiStyleMod {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiStyleMod,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiStyleMod() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiStyleMod> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiStyleMod>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiStyleMod))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiStyleMod>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiStyleMod))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiStyleMod),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiStyleMod),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiStyleMod),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiID {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiID,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiID() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiID> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiID>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiID))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiID>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiID))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiID),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiID),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiID),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiItemFlags {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiItemFlags,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiItemFlags() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiItemFlags> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiItemFlags>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiItemFlags))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiItemFlags>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiItemFlags))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiItemFlags),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiItemFlags),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiItemFlags),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiGroupData {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiGroupData,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiGroupData() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiGroupData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiGroupData>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiGroupData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiGroupData>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiGroupData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiGroupData),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiGroupData),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiGroupData),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiPopupData {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiPopupData,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiPopupData() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiPopupData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiPopupData>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiPopupData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiPopupData>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiPopupData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiPopupData),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiPopupData),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiPopupData),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiViewportPPtr {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut *mut ImGuiViewportP,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiViewportPPtr() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiViewportPPtr> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiViewportPPtr>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiViewportPPtr))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiViewportPPtr>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiViewportPPtr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiViewportPPtr),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiViewportPPtr),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiViewportPPtr),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_unsigned_char {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_ImVector_unsigned_char() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_unsigned_char> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_unsigned_char>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_unsigned_char))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_unsigned_char>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_unsigned_char))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_unsigned_char),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_unsigned_char),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_unsigned_char),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiListClipperData {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiListClipperData,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiListClipperData() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiListClipperData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiListClipperData>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiListClipperData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiListClipperData>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiListClipperData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiListClipperData),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiListClipperData),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiListClipperData),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiTableTempData {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiTableTempData,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiTableTempData() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiTableTempData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiTableTempData>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiTableTempData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiTableTempData>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiTableTempData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTableTempData),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTableTempData),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTableTempData),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiTable {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiTable,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiTable() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiTable> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiTable>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiTable))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiTable>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiTable))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTable),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTable),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTable),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
pub struct ImPool_ImGuiTable {
    pub Buf: ImVector_ImGuiTable,
    pub Map: ImGuiStorage,
    pub FreeIdx: ImPoolIdx,
    pub AliveCount: ImPoolIdx,
}
#[test]
fn bindgen_test_layout_ImPool_ImGuiTable() {
    const UNINIT: ::std::mem::MaybeUninit<ImPool_ImGuiTable> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPool_ImGuiTable>(),
        40usize,
        concat!("Size of: ", stringify!(ImPool_ImGuiTable))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPool_ImGuiTable>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPool_ImGuiTable))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Buf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImGuiTable),
            "::",
            stringify!(Buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Map) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImGuiTable),
            "::",
            stringify!(Map)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FreeIdx) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImGuiTable),
            "::",
            stringify!(FreeIdx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AliveCount) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImGuiTable),
            "::",
            stringify!(AliveCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiTabBar {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiTabBar,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiTabBar() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiTabBar> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiTabBar>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiTabBar))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiTabBar>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiTabBar))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTabBar),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTabBar),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTabBar),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
pub struct ImPool_ImGuiTabBar {
    pub Buf: ImVector_ImGuiTabBar,
    pub Map: ImGuiStorage,
    pub FreeIdx: ImPoolIdx,
    pub AliveCount: ImPoolIdx,
}
#[test]
fn bindgen_test_layout_ImPool_ImGuiTabBar() {
    const UNINIT: ::std::mem::MaybeUninit<ImPool_ImGuiTabBar> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPool_ImGuiTabBar>(),
        40usize,
        concat!("Size of: ", stringify!(ImPool_ImGuiTabBar))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPool_ImGuiTabBar>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPool_ImGuiTabBar))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Buf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImGuiTabBar),
            "::",
            stringify!(Buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Map) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImGuiTabBar),
            "::",
            stringify!(Map)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FreeIdx) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImGuiTabBar),
            "::",
            stringify!(FreeIdx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AliveCount) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImGuiTabBar),
            "::",
            stringify!(AliveCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiPtrOrIndex {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiPtrOrIndex,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiPtrOrIndex() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiPtrOrIndex> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiPtrOrIndex>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiPtrOrIndex))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiPtrOrIndex>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiPtrOrIndex))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiPtrOrIndex),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiPtrOrIndex),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiPtrOrIndex),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiShrinkWidthItem {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiShrinkWidthItem,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiShrinkWidthItem() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiShrinkWidthItem> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiShrinkWidthItem>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiShrinkWidthItem))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiShrinkWidthItem>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiShrinkWidthItem))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiShrinkWidthItem),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiShrinkWidthItem),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiShrinkWidthItem),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiSettingsHandler {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiSettingsHandler,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiSettingsHandler() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiSettingsHandler> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiSettingsHandler>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiSettingsHandler))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiSettingsHandler>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiSettingsHandler))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiSettingsHandler),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiSettingsHandler),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiSettingsHandler),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiContextHook {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiContextHook,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiContextHook() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiContextHook> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiContextHook>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiContextHook))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiContextHook>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiContextHook))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiContextHook),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiContextHook),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiContextHook),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiOldColumns {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiOldColumns,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiOldColumns() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiOldColumns> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiOldColumns>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiOldColumns))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiOldColumns>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiOldColumns))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiOldColumns),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiOldColumns),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiOldColumns),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiTabItem {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiTabItem,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiTabItem() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiTabItem> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiTabItem>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiTabItem))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiTabItem>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiTabItem))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTabItem),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTabItem),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTabItem),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiTableInstanceData {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiTableInstanceData,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiTableInstanceData() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiTableInstanceData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiTableInstanceData>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiTableInstanceData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiTableInstanceData>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImGuiTableInstanceData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTableInstanceData),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTableInstanceData),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTableInstanceData),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImGuiTableColumnSortSpecs {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImGuiTableColumnSortSpecs,
}
#[test]
fn bindgen_test_layout_ImVector_ImGuiTableColumnSortSpecs() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImGuiTableColumnSortSpecs> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImGuiTableColumnSortSpecs>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImGuiTableColumnSortSpecs))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImGuiTableColumnSortSpecs>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ImVector_ImGuiTableColumnSortSpecs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTableColumnSortSpecs),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTableColumnSortSpecs),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImGuiTableColumnSortSpecs),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImPlotAxisColor {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImS16 {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImS16,
}
#[test]
fn bindgen_test_layout_ImVector_ImS16() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImS16> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImS16>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImS16))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImS16>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImS16))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImS16),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImS16),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImS16),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImS32 {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImS32,
}
#[test]
fn bindgen_test_layout_ImVector_ImS32() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImS32> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImS32>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImS32))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImS32>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImS32))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImS32),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImS32),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImS32),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImS64 {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImS64,
}
#[test]
fn bindgen_test_layout_ImVector_ImS64() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImS64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImS64>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImS64))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImS64>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImS64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImS64),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImS64),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImS64),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImS8 {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImS8,
}
#[test]
fn bindgen_test_layout_ImVector_ImS8() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImS8> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImS8>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImS8))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImS8>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImS8))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImS8),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImS8),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImS8),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImU16 {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImU16,
}
#[test]
fn bindgen_test_layout_ImVector_ImU16() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImU16> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImU16>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImU16))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImU16>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImU16))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImU16),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImU16),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImU16),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImU64 {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImU64,
}
#[test]
fn bindgen_test_layout_ImVector_ImU64() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImU64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImU64>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImU64))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImU64>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImU64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImU64),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImU64),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImU64),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImU8 {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImU8,
}
#[test]
fn bindgen_test_layout_ImVector_ImU8() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImU8> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImU8>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImU8))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImU8>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImU8))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImU8),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImU8),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImU8),
            "::",
            stringify!(Data)
        )
    );
}
pub type ImAxis = ::std::os::raw::c_int;
pub type ImPlotFlags = ::std::os::raw::c_int;
pub type ImPlotAxisFlags = ::std::os::raw::c_int;
pub type ImPlotSubplotFlags = ::std::os::raw::c_int;
pub type ImPlotLegendFlags = ::std::os::raw::c_int;
pub type ImPlotMouseTextFlags = ::std::os::raw::c_int;
pub type ImPlotDragToolFlags = ::std::os::raw::c_int;
pub type ImPlotColormapScaleFlags = ::std::os::raw::c_int;
pub type ImPlotItemFlags = ::std::os::raw::c_int;
pub type ImPlotLineFlags = ::std::os::raw::c_int;
pub type ImPlotScatterFlags = ::std::os::raw::c_int;
pub type ImPlotStairsFlags = ::std::os::raw::c_int;
pub type ImPlotShadedFlags = ::std::os::raw::c_int;
pub type ImPlotBarsFlags = ::std::os::raw::c_int;
pub type ImPlotBarGroupsFlags = ::std::os::raw::c_int;
pub type ImPlotErrorBarsFlags = ::std::os::raw::c_int;
pub type ImPlotStemsFlags = ::std::os::raw::c_int;
pub type ImPlotInfLinesFlags = ::std::os::raw::c_int;
pub type ImPlotPieChartFlags = ::std::os::raw::c_int;
pub type ImPlotHeatmapFlags = ::std::os::raw::c_int;
pub type ImPlotHistogramFlags = ::std::os::raw::c_int;
pub type ImPlotDigitalFlags = ::std::os::raw::c_int;
pub type ImPlotImageFlags = ::std::os::raw::c_int;
pub type ImPlotTextFlags = ::std::os::raw::c_int;
pub type ImPlotDummyFlags = ::std::os::raw::c_int;
pub type ImPlotCond = ::std::os::raw::c_int;
pub type ImPlotCol = ::std::os::raw::c_int;
pub type ImPlotStyleVar = ::std::os::raw::c_int;
pub type ImPlotScale = ::std::os::raw::c_int;
pub type ImPlotMarker = ::std::os::raw::c_int;
pub type ImPlotColormap = ::std::os::raw::c_int;
pub type ImPlotLocation = ::std::os::raw::c_int;
pub type ImPlotBin = ::std::os::raw::c_int;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ImAxis_ {
    X1 = 0,
    X2 = 1,
    X3 = 2,
    Y1 = 3,
    Y2 = 4,
    Y3 = 5,
    COUNT = 6,
}
impl ImPlotFlags_ {
    pub const NONE: ImPlotFlags_ = ImPlotFlags_(0);
}
impl ImPlotFlags_ {
    pub const NO_TITLE: ImPlotFlags_ = ImPlotFlags_(1);
}
impl ImPlotFlags_ {
    pub const NO_LEGEND: ImPlotFlags_ = ImPlotFlags_(2);
}
impl ImPlotFlags_ {
    pub const NO_MOUSE_TEXT: ImPlotFlags_ = ImPlotFlags_(4);
}
impl ImPlotFlags_ {
    pub const NO_INPUTS: ImPlotFlags_ = ImPlotFlags_(8);
}
impl ImPlotFlags_ {
    pub const NO_MENUS: ImPlotFlags_ = ImPlotFlags_(16);
}
impl ImPlotFlags_ {
    pub const NO_BOX_SELECT: ImPlotFlags_ = ImPlotFlags_(32);
}
impl ImPlotFlags_ {
    pub const NO_FRAME: ImPlotFlags_ = ImPlotFlags_(64);
}
impl ImPlotFlags_ {
    pub const EQUAL: ImPlotFlags_ = ImPlotFlags_(128);
}
impl ImPlotFlags_ {
    pub const CROSSHAIRS: ImPlotFlags_ = ImPlotFlags_(256);
}
impl ImPlotFlags_ {
    pub const CANVAS_ONLY: ImPlotFlags_ = ImPlotFlags_(55);
}
impl ::std::ops::BitOr<ImPlotFlags_> for ImPlotFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotFlags_> for ImPlotFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotFlags_(pub ::std::os::raw::c_uint);
impl ImPlotAxisFlags_ {
    pub const NONE: ImPlotAxisFlags_ = ImPlotAxisFlags_(0);
}
impl ImPlotAxisFlags_ {
    pub const NO_LABEL: ImPlotAxisFlags_ = ImPlotAxisFlags_(1);
}
impl ImPlotAxisFlags_ {
    pub const NO_GRID_LINES: ImPlotAxisFlags_ = ImPlotAxisFlags_(2);
}
impl ImPlotAxisFlags_ {
    pub const NO_TICK_MARKS: ImPlotAxisFlags_ = ImPlotAxisFlags_(4);
}
impl ImPlotAxisFlags_ {
    pub const NO_TICK_LABELS: ImPlotAxisFlags_ = ImPlotAxisFlags_(8);
}
impl ImPlotAxisFlags_ {
    pub const NO_INITIAL_FIT: ImPlotAxisFlags_ = ImPlotAxisFlags_(16);
}
impl ImPlotAxisFlags_ {
    pub const NO_MENUS: ImPlotAxisFlags_ = ImPlotAxisFlags_(32);
}
impl ImPlotAxisFlags_ {
    pub const NO_SIDE_SWITCH: ImPlotAxisFlags_ = ImPlotAxisFlags_(64);
}
impl ImPlotAxisFlags_ {
    pub const NO_HIGHLIGHT: ImPlotAxisFlags_ = ImPlotAxisFlags_(128);
}
impl ImPlotAxisFlags_ {
    pub const OPPOSITE: ImPlotAxisFlags_ = ImPlotAxisFlags_(256);
}
impl ImPlotAxisFlags_ {
    pub const FOREGROUND: ImPlotAxisFlags_ = ImPlotAxisFlags_(512);
}
impl ImPlotAxisFlags_ {
    pub const INVERT: ImPlotAxisFlags_ = ImPlotAxisFlags_(1024);
}
impl ImPlotAxisFlags_ {
    pub const AUTO_FIT: ImPlotAxisFlags_ = ImPlotAxisFlags_(2048);
}
impl ImPlotAxisFlags_ {
    pub const RANGE_FIT: ImPlotAxisFlags_ = ImPlotAxisFlags_(4096);
}
impl ImPlotAxisFlags_ {
    pub const PAN_STRETCH: ImPlotAxisFlags_ = ImPlotAxisFlags_(8192);
}
impl ImPlotAxisFlags_ {
    pub const LOCK_MIN: ImPlotAxisFlags_ = ImPlotAxisFlags_(16384);
}
impl ImPlotAxisFlags_ {
    pub const LOCK_MAX: ImPlotAxisFlags_ = ImPlotAxisFlags_(32768);
}
impl ImPlotAxisFlags_ {
    pub const LOCK: ImPlotAxisFlags_ = ImPlotAxisFlags_(49152);
}
impl ImPlotAxisFlags_ {
    pub const NO_DECORATIONS: ImPlotAxisFlags_ = ImPlotAxisFlags_(15);
}
impl ImPlotAxisFlags_ {
    pub const AUX_DEFAULT: ImPlotAxisFlags_ = ImPlotAxisFlags_(258);
}
impl ::std::ops::BitOr<ImPlotAxisFlags_> for ImPlotAxisFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotAxisFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotAxisFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotAxisFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotAxisFlags_> for ImPlotAxisFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotAxisFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotAxisFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotAxisFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotAxisFlags_(pub ::std::os::raw::c_uint);
impl ImPlotSubplotFlags_ {
    pub const NONE: ImPlotSubplotFlags_ = ImPlotSubplotFlags_(0);
}
impl ImPlotSubplotFlags_ {
    pub const NO_TITLE: ImPlotSubplotFlags_ = ImPlotSubplotFlags_(1);
}
impl ImPlotSubplotFlags_ {
    pub const NO_LEGEND: ImPlotSubplotFlags_ = ImPlotSubplotFlags_(2);
}
impl ImPlotSubplotFlags_ {
    pub const NO_MENUS: ImPlotSubplotFlags_ = ImPlotSubplotFlags_(4);
}
impl ImPlotSubplotFlags_ {
    pub const NO_RESIZE: ImPlotSubplotFlags_ = ImPlotSubplotFlags_(8);
}
impl ImPlotSubplotFlags_ {
    pub const NO_ALIGN: ImPlotSubplotFlags_ = ImPlotSubplotFlags_(16);
}
impl ImPlotSubplotFlags_ {
    pub const SHARE_ITEMS: ImPlotSubplotFlags_ = ImPlotSubplotFlags_(32);
}
impl ImPlotSubplotFlags_ {
    pub const LINK_ROWS: ImPlotSubplotFlags_ = ImPlotSubplotFlags_(64);
}
impl ImPlotSubplotFlags_ {
    pub const LINK_COLS: ImPlotSubplotFlags_ = ImPlotSubplotFlags_(128);
}
impl ImPlotSubplotFlags_ {
    pub const LINK_ALL_X: ImPlotSubplotFlags_ = ImPlotSubplotFlags_(256);
}
impl ImPlotSubplotFlags_ {
    pub const LINK_ALL_Y: ImPlotSubplotFlags_ = ImPlotSubplotFlags_(512);
}
impl ImPlotSubplotFlags_ {
    pub const COL_MAJOR: ImPlotSubplotFlags_ = ImPlotSubplotFlags_(1024);
}
impl ::std::ops::BitOr<ImPlotSubplotFlags_> for ImPlotSubplotFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotSubplotFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotSubplotFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotSubplotFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotSubplotFlags_> for ImPlotSubplotFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotSubplotFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotSubplotFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotSubplotFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotSubplotFlags_(pub ::std::os::raw::c_uint);
impl ImPlotLegendFlags_ {
    pub const NONE: ImPlotLegendFlags_ = ImPlotLegendFlags_(0);
}
impl ImPlotLegendFlags_ {
    pub const NO_BUTTONS: ImPlotLegendFlags_ = ImPlotLegendFlags_(1);
}
impl ImPlotLegendFlags_ {
    pub const NO_HIGHLIGHT_ITEM: ImPlotLegendFlags_ = ImPlotLegendFlags_(2);
}
impl ImPlotLegendFlags_ {
    pub const NO_HIGHLIGHT_AXIS: ImPlotLegendFlags_ = ImPlotLegendFlags_(4);
}
impl ImPlotLegendFlags_ {
    pub const NO_MENUS: ImPlotLegendFlags_ = ImPlotLegendFlags_(8);
}
impl ImPlotLegendFlags_ {
    pub const OUTSIDE: ImPlotLegendFlags_ = ImPlotLegendFlags_(16);
}
impl ImPlotLegendFlags_ {
    pub const HORIZONTAL: ImPlotLegendFlags_ = ImPlotLegendFlags_(32);
}
impl ImPlotLegendFlags_ {
    pub const SORT: ImPlotLegendFlags_ = ImPlotLegendFlags_(64);
}
impl ::std::ops::BitOr<ImPlotLegendFlags_> for ImPlotLegendFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotLegendFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotLegendFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotLegendFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotLegendFlags_> for ImPlotLegendFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotLegendFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotLegendFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotLegendFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotLegendFlags_(pub ::std::os::raw::c_uint);
impl ImPlotMouseTextFlags_ {
    pub const NONE: ImPlotMouseTextFlags_ = ImPlotMouseTextFlags_(0);
}
impl ImPlotMouseTextFlags_ {
    pub const NO_AUX_AXES: ImPlotMouseTextFlags_ = ImPlotMouseTextFlags_(1);
}
impl ImPlotMouseTextFlags_ {
    pub const NO_FORMAT: ImPlotMouseTextFlags_ = ImPlotMouseTextFlags_(2);
}
impl ImPlotMouseTextFlags_ {
    pub const SHOW_ALWAYS: ImPlotMouseTextFlags_ = ImPlotMouseTextFlags_(4);
}
impl ::std::ops::BitOr<ImPlotMouseTextFlags_> for ImPlotMouseTextFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotMouseTextFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotMouseTextFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotMouseTextFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotMouseTextFlags_> for ImPlotMouseTextFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotMouseTextFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotMouseTextFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotMouseTextFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotMouseTextFlags_(pub ::std::os::raw::c_uint);
impl ImPlotDragToolFlags_ {
    pub const NONE: ImPlotDragToolFlags_ = ImPlotDragToolFlags_(0);
}
impl ImPlotDragToolFlags_ {
    pub const NO_CURSORS: ImPlotDragToolFlags_ = ImPlotDragToolFlags_(1);
}
impl ImPlotDragToolFlags_ {
    pub const NO_FIT: ImPlotDragToolFlags_ = ImPlotDragToolFlags_(2);
}
impl ImPlotDragToolFlags_ {
    pub const NO_INPUTS: ImPlotDragToolFlags_ = ImPlotDragToolFlags_(4);
}
impl ImPlotDragToolFlags_ {
    pub const DELAYED: ImPlotDragToolFlags_ = ImPlotDragToolFlags_(8);
}
impl ::std::ops::BitOr<ImPlotDragToolFlags_> for ImPlotDragToolFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotDragToolFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotDragToolFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotDragToolFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotDragToolFlags_> for ImPlotDragToolFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotDragToolFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotDragToolFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotDragToolFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotDragToolFlags_(pub ::std::os::raw::c_uint);
impl ImPlotColormapScaleFlags_ {
    pub const NONE: ImPlotColormapScaleFlags_ = ImPlotColormapScaleFlags_(0);
}
impl ImPlotColormapScaleFlags_ {
    pub const NO_LABEL: ImPlotColormapScaleFlags_ = ImPlotColormapScaleFlags_(1);
}
impl ImPlotColormapScaleFlags_ {
    pub const OPPOSITE: ImPlotColormapScaleFlags_ = ImPlotColormapScaleFlags_(2);
}
impl ImPlotColormapScaleFlags_ {
    pub const INVERT: ImPlotColormapScaleFlags_ = ImPlotColormapScaleFlags_(4);
}
impl ::std::ops::BitOr<ImPlotColormapScaleFlags_> for ImPlotColormapScaleFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotColormapScaleFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotColormapScaleFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotColormapScaleFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotColormapScaleFlags_> for ImPlotColormapScaleFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotColormapScaleFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotColormapScaleFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotColormapScaleFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotColormapScaleFlags_(pub ::std::os::raw::c_uint);
impl ImPlotItemFlags_ {
    pub const NONE: ImPlotItemFlags_ = ImPlotItemFlags_(0);
}
impl ImPlotItemFlags_ {
    pub const NO_LEGEND: ImPlotItemFlags_ = ImPlotItemFlags_(1);
}
impl ImPlotItemFlags_ {
    pub const NO_FIT: ImPlotItemFlags_ = ImPlotItemFlags_(2);
}
impl ::std::ops::BitOr<ImPlotItemFlags_> for ImPlotItemFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotItemFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotItemFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotItemFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotItemFlags_> for ImPlotItemFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotItemFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotItemFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotItemFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotItemFlags_(pub ::std::os::raw::c_uint);
impl ImPlotLineFlags_ {
    pub const NONE: ImPlotLineFlags_ = ImPlotLineFlags_(0);
}
impl ImPlotLineFlags_ {
    pub const SEGMENTS: ImPlotLineFlags_ = ImPlotLineFlags_(1024);
}
impl ImPlotLineFlags_ {
    pub const LOOP: ImPlotLineFlags_ = ImPlotLineFlags_(2048);
}
impl ImPlotLineFlags_ {
    pub const SKIP_NAN: ImPlotLineFlags_ = ImPlotLineFlags_(4096);
}
impl ImPlotLineFlags_ {
    pub const NO_CLIP: ImPlotLineFlags_ = ImPlotLineFlags_(8192);
}
impl ImPlotLineFlags_ {
    pub const SHADED: ImPlotLineFlags_ = ImPlotLineFlags_(16384);
}
impl ::std::ops::BitOr<ImPlotLineFlags_> for ImPlotLineFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotLineFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotLineFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotLineFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotLineFlags_> for ImPlotLineFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotLineFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotLineFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotLineFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotLineFlags_(pub ::std::os::raw::c_uint);
impl ImPlotScatterFlags_ {
    pub const NONE: ImPlotScatterFlags_ = ImPlotScatterFlags_(0);
}
impl ImPlotScatterFlags_ {
    pub const NO_CLIP: ImPlotScatterFlags_ = ImPlotScatterFlags_(1024);
}
impl ::std::ops::BitOr<ImPlotScatterFlags_> for ImPlotScatterFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotScatterFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotScatterFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotScatterFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotScatterFlags_> for ImPlotScatterFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotScatterFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotScatterFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotScatterFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotScatterFlags_(pub ::std::os::raw::c_uint);
impl ImPlotStairsFlags_ {
    pub const NONE: ImPlotStairsFlags_ = ImPlotStairsFlags_(0);
}
impl ImPlotStairsFlags_ {
    pub const PRE_STEP: ImPlotStairsFlags_ = ImPlotStairsFlags_(1024);
}
impl ImPlotStairsFlags_ {
    pub const SHADED: ImPlotStairsFlags_ = ImPlotStairsFlags_(2048);
}
impl ::std::ops::BitOr<ImPlotStairsFlags_> for ImPlotStairsFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotStairsFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotStairsFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotStairsFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotStairsFlags_> for ImPlotStairsFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotStairsFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotStairsFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotStairsFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotStairsFlags_(pub ::std::os::raw::c_uint);
impl ImPlotShadedFlags_ {
    pub const NONE: ImPlotShadedFlags_ = ImPlotShadedFlags_(0);
}
impl ::std::ops::BitOr<ImPlotShadedFlags_> for ImPlotShadedFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotShadedFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotShadedFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotShadedFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotShadedFlags_> for ImPlotShadedFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotShadedFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotShadedFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotShadedFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotShadedFlags_(pub ::std::os::raw::c_uint);
impl ImPlotBarsFlags_ {
    pub const NONE: ImPlotBarsFlags_ = ImPlotBarsFlags_(0);
}
impl ImPlotBarsFlags_ {
    pub const HORIZONTAL: ImPlotBarsFlags_ = ImPlotBarsFlags_(1024);
}
impl ::std::ops::BitOr<ImPlotBarsFlags_> for ImPlotBarsFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotBarsFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotBarsFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotBarsFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotBarsFlags_> for ImPlotBarsFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotBarsFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotBarsFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotBarsFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotBarsFlags_(pub ::std::os::raw::c_uint);
impl ImPlotBarGroupsFlags_ {
    pub const NONE: ImPlotBarGroupsFlags_ = ImPlotBarGroupsFlags_(0);
}
impl ImPlotBarGroupsFlags_ {
    pub const HORIZONTAL: ImPlotBarGroupsFlags_ = ImPlotBarGroupsFlags_(1024);
}
impl ImPlotBarGroupsFlags_ {
    pub const STACKED: ImPlotBarGroupsFlags_ = ImPlotBarGroupsFlags_(2048);
}
impl ::std::ops::BitOr<ImPlotBarGroupsFlags_> for ImPlotBarGroupsFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotBarGroupsFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotBarGroupsFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotBarGroupsFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotBarGroupsFlags_> for ImPlotBarGroupsFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotBarGroupsFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotBarGroupsFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotBarGroupsFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotBarGroupsFlags_(pub ::std::os::raw::c_uint);
impl ImPlotErrorBarsFlags_ {
    pub const NONE: ImPlotErrorBarsFlags_ = ImPlotErrorBarsFlags_(0);
}
impl ImPlotErrorBarsFlags_ {
    pub const HORIZONTAL: ImPlotErrorBarsFlags_ = ImPlotErrorBarsFlags_(1024);
}
impl ::std::ops::BitOr<ImPlotErrorBarsFlags_> for ImPlotErrorBarsFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotErrorBarsFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotErrorBarsFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotErrorBarsFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotErrorBarsFlags_> for ImPlotErrorBarsFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotErrorBarsFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotErrorBarsFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotErrorBarsFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotErrorBarsFlags_(pub ::std::os::raw::c_uint);
impl ImPlotStemsFlags_ {
    pub const NONE: ImPlotStemsFlags_ = ImPlotStemsFlags_(0);
}
impl ImPlotStemsFlags_ {
    pub const HORIZONTAL: ImPlotStemsFlags_ = ImPlotStemsFlags_(1024);
}
impl ::std::ops::BitOr<ImPlotStemsFlags_> for ImPlotStemsFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotStemsFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotStemsFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotStemsFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotStemsFlags_> for ImPlotStemsFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotStemsFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotStemsFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotStemsFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotStemsFlags_(pub ::std::os::raw::c_uint);
impl ImPlotInfLinesFlags_ {
    pub const NONE: ImPlotInfLinesFlags_ = ImPlotInfLinesFlags_(0);
}
impl ImPlotInfLinesFlags_ {
    pub const HORIZONTAL: ImPlotInfLinesFlags_ = ImPlotInfLinesFlags_(1024);
}
impl ::std::ops::BitOr<ImPlotInfLinesFlags_> for ImPlotInfLinesFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotInfLinesFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotInfLinesFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotInfLinesFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotInfLinesFlags_> for ImPlotInfLinesFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotInfLinesFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotInfLinesFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotInfLinesFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotInfLinesFlags_(pub ::std::os::raw::c_uint);
impl ImPlotPieChartFlags_ {
    pub const NONE: ImPlotPieChartFlags_ = ImPlotPieChartFlags_(0);
}
impl ImPlotPieChartFlags_ {
    pub const NORMALIZE: ImPlotPieChartFlags_ = ImPlotPieChartFlags_(1024);
}
impl ImPlotPieChartFlags_ {
    pub const IGNORE_HIDDEN: ImPlotPieChartFlags_ = ImPlotPieChartFlags_(2048);
}
impl ::std::ops::BitOr<ImPlotPieChartFlags_> for ImPlotPieChartFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotPieChartFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotPieChartFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotPieChartFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotPieChartFlags_> for ImPlotPieChartFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotPieChartFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotPieChartFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotPieChartFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotPieChartFlags_(pub ::std::os::raw::c_uint);
impl ImPlotHeatmapFlags_ {
    pub const NONE: ImPlotHeatmapFlags_ = ImPlotHeatmapFlags_(0);
}
impl ImPlotHeatmapFlags_ {
    pub const COL_MAJOR: ImPlotHeatmapFlags_ = ImPlotHeatmapFlags_(1024);
}
impl ::std::ops::BitOr<ImPlotHeatmapFlags_> for ImPlotHeatmapFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotHeatmapFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotHeatmapFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotHeatmapFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotHeatmapFlags_> for ImPlotHeatmapFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotHeatmapFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotHeatmapFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotHeatmapFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotHeatmapFlags_(pub ::std::os::raw::c_uint);
impl ImPlotHistogramFlags_ {
    pub const NONE: ImPlotHistogramFlags_ = ImPlotHistogramFlags_(0);
}
impl ImPlotHistogramFlags_ {
    pub const HORIZONTAL: ImPlotHistogramFlags_ = ImPlotHistogramFlags_(1024);
}
impl ImPlotHistogramFlags_ {
    pub const CUMULATIVE: ImPlotHistogramFlags_ = ImPlotHistogramFlags_(2048);
}
impl ImPlotHistogramFlags_ {
    pub const DENSITY: ImPlotHistogramFlags_ = ImPlotHistogramFlags_(4096);
}
impl ImPlotHistogramFlags_ {
    pub const NO_OUTLIERS: ImPlotHistogramFlags_ = ImPlotHistogramFlags_(8192);
}
impl ImPlotHistogramFlags_ {
    pub const COL_MAJOR: ImPlotHistogramFlags_ = ImPlotHistogramFlags_(16384);
}
impl ::std::ops::BitOr<ImPlotHistogramFlags_> for ImPlotHistogramFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotHistogramFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotHistogramFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotHistogramFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotHistogramFlags_> for ImPlotHistogramFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotHistogramFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotHistogramFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotHistogramFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotHistogramFlags_(pub ::std::os::raw::c_uint);
impl ImPlotDigitalFlags_ {
    pub const NONE: ImPlotDigitalFlags_ = ImPlotDigitalFlags_(0);
}
impl ::std::ops::BitOr<ImPlotDigitalFlags_> for ImPlotDigitalFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotDigitalFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotDigitalFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotDigitalFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotDigitalFlags_> for ImPlotDigitalFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotDigitalFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotDigitalFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotDigitalFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotDigitalFlags_(pub ::std::os::raw::c_uint);
impl ImPlotImageFlags_ {
    pub const NONE: ImPlotImageFlags_ = ImPlotImageFlags_(0);
}
impl ::std::ops::BitOr<ImPlotImageFlags_> for ImPlotImageFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotImageFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotImageFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotImageFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotImageFlags_> for ImPlotImageFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotImageFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotImageFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotImageFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotImageFlags_(pub ::std::os::raw::c_uint);
impl ImPlotTextFlags_ {
    pub const NONE: ImPlotTextFlags_ = ImPlotTextFlags_(0);
}
impl ImPlotTextFlags_ {
    pub const VERTICAL: ImPlotTextFlags_ = ImPlotTextFlags_(1024);
}
impl ::std::ops::BitOr<ImPlotTextFlags_> for ImPlotTextFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotTextFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotTextFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotTextFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotTextFlags_> for ImPlotTextFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotTextFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotTextFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotTextFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotTextFlags_(pub ::std::os::raw::c_uint);
impl ImPlotDummyFlags_ {
    pub const NONE: ImPlotDummyFlags_ = ImPlotDummyFlags_(0);
}
impl ::std::ops::BitOr<ImPlotDummyFlags_> for ImPlotDummyFlags_ {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        ImPlotDummyFlags_(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for ImPlotDummyFlags_ {
    #[inline]
    fn bitor_assign(&mut self, rhs: ImPlotDummyFlags_) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<ImPlotDummyFlags_> for ImPlotDummyFlags_ {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        ImPlotDummyFlags_(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for ImPlotDummyFlags_ {
    #[inline]
    fn bitand_assign(&mut self, rhs: ImPlotDummyFlags_) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ImPlotDummyFlags_(pub ::std::os::raw::c_uint);
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ImPlotCond_ {
    None = 0,
    Always = 1,
    Once = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ImPlotCol_ {
    Line = 0,
    Fill = 1,
    MarkerOutline = 2,
    MarkerFill = 3,
    ErrorBar = 4,
    FrameBg = 5,
    PlotBg = 6,
    PlotBorder = 7,
    LegendBg = 8,
    LegendBorder = 9,
    LegendText = 10,
    TitleText = 11,
    InlayText = 12,
    AxisText = 13,
    AxisGrid = 14,
    AxisTick = 15,
    AxisBg = 16,
    AxisBgHovered = 17,
    AxisBgActive = 18,
    Selection = 19,
    Crosshairs = 20,
    COUNT = 21,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ImPlotStyleVar_ {
    LineWeight = 0,
    Marker = 1,
    MarkerSize = 2,
    MarkerWeight = 3,
    FillAlpha = 4,
    ErrorBarSize = 5,
    ErrorBarWeight = 6,
    DigitalBitHeight = 7,
    DigitalBitGap = 8,
    PlotBorderSize = 9,
    MinorAlpha = 10,
    MajorTickLen = 11,
    MinorTickLen = 12,
    MajorTickSize = 13,
    MinorTickSize = 14,
    MajorGridSize = 15,
    MinorGridSize = 16,
    PlotPadding = 17,
    LabelPadding = 18,
    LegendPadding = 19,
    LegendInnerPadding = 20,
    LegendSpacing = 21,
    MousePosPadding = 22,
    AnnotationPadding = 23,
    FitPadding = 24,
    PlotDefaultSize = 25,
    PlotMinSize = 26,
    COUNT = 27,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ImPlotScale_ {
    Linear = 0,
    Time = 1,
    Log10 = 2,
    SymLog = 3,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ImPlotMarker_ {
    None = -1,
    Circle = 0,
    Square = 1,
    Diamond = 2,
    Up = 3,
    Down = 4,
    Left = 5,
    Right = 6,
    Cross = 7,
    Plus = 8,
    Asterisk = 9,
    COUNT = 10,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ImPlotColormap_ {
    Deep = 0,
    Dark = 1,
    Pastel = 2,
    Paired = 3,
    Viridis = 4,
    Plasma = 5,
    Hot = 6,
    Cool = 7,
    Pink = 8,
    Jet = 9,
    Twilight = 10,
    RdBu = 11,
    BrBG = 12,
    PiYG = 13,
    Spectral = 14,
    Greys = 15,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ImPlotLocation_ {
    Center = 0,
    North = 1,
    South = 2,
    West = 4,
    East = 8,
    NorthWest = 5,
    NorthEast = 9,
    SouthWest = 6,
    SouthEast = 10,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ImPlotBin_ {
    Sqrt = -1,
    Sturges = -2,
    Rice = -3,
    Scott = -4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImPlotPoint {
    pub x: f64,
    pub y: f64,
}
#[test]
fn bindgen_test_layout_ImPlotPoint() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotPoint> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotPoint>(),
        16usize,
        concat!("Size of: ", stringify!(ImPlotPoint))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotPoint>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotPoint))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPoint),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPoint),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImPlotRange {
    pub Min: f64,
    pub Max: f64,
}
#[test]
fn bindgen_test_layout_ImPlotRange() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotRange> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotRange>(),
        16usize,
        concat!("Size of: ", stringify!(ImPlotRange))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotRange>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotRange))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Min) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotRange),
            "::",
            stringify!(Min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Max) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotRange),
            "::",
            stringify!(Max)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImPlotRect {
    pub X: ImPlotRange,
    pub Y: ImPlotRange,
}
#[test]
fn bindgen_test_layout_ImPlotRect() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotRect> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotRect>(),
        32usize,
        concat!("Size of: ", stringify!(ImPlotRect))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotRect>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotRect))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).X) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotRect),
            "::",
            stringify!(X)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Y) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotRect),
            "::",
            stringify!(Y)
        )
    );
}
#[repr(C)]
#[derive(Clone, Copy, Debug)]
pub struct ImPlotStyle {
    pub LineWeight: f32,
    pub Marker: ::std::os::raw::c_int,
    pub MarkerSize: f32,
    pub MarkerWeight: f32,
    pub FillAlpha: f32,
    pub ErrorBarSize: f32,
    pub ErrorBarWeight: f32,
    pub DigitalBitHeight: f32,
    pub DigitalBitGap: f32,
    pub PlotBorderSize: f32,
    pub MinorAlpha: f32,
    pub MajorTickLen: ImVec2,
    pub MinorTickLen: ImVec2,
    pub MajorTickSize: ImVec2,
    pub MinorTickSize: ImVec2,
    pub MajorGridSize: ImVec2,
    pub MinorGridSize: ImVec2,
    pub PlotPadding: ImVec2,
    pub LabelPadding: ImVec2,
    pub LegendPadding: ImVec2,
    pub LegendInnerPadding: ImVec2,
    pub LegendSpacing: ImVec2,
    pub MousePosPadding: ImVec2,
    pub AnnotationPadding: ImVec2,
    pub FitPadding: ImVec2,
    pub PlotDefaultSize: ImVec2,
    pub PlotMinSize: ImVec2,
    pub Colors: [ImVec4; 21usize],
    pub Colormap: ImPlotColormap,
    pub UseLocalTime: bool,
    pub UseISO8601: bool,
    pub Use24HourClock: bool,
}
#[test]
fn bindgen_test_layout_ImPlotStyle() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotStyle> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotStyle>(),
        516usize,
        concat!("Size of: ", stringify!(ImPlotStyle))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotStyle>(),
        4usize,
        concat!("Alignment of ", stringify!(ImPlotStyle))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LineWeight) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(LineWeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Marker) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(Marker)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MarkerSize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(MarkerSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MarkerWeight) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(MarkerWeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FillAlpha) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(FillAlpha)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ErrorBarSize) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(ErrorBarSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ErrorBarWeight) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(ErrorBarWeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DigitalBitHeight) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(DigitalBitHeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DigitalBitGap) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(DigitalBitGap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PlotBorderSize) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(PlotBorderSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinorAlpha) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(MinorAlpha)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MajorTickLen) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(MajorTickLen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinorTickLen) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(MinorTickLen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MajorTickSize) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(MajorTickSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinorTickSize) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(MinorTickSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MajorGridSize) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(MajorGridSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinorGridSize) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(MinorGridSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PlotPadding) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(PlotPadding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LabelPadding) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(LabelPadding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LegendPadding) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(LegendPadding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LegendInnerPadding) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(LegendInnerPadding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LegendSpacing) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(LegendSpacing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MousePosPadding) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(MousePosPadding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AnnotationPadding) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(AnnotationPadding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FitPadding) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(FitPadding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PlotDefaultSize) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(PlotDefaultSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PlotMinSize) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(PlotMinSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Colors) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(Colors)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Colormap) as usize - ptr as usize },
        508usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(Colormap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UseLocalTime) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(UseLocalTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UseISO8601) as usize - ptr as usize },
        513usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(UseISO8601)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Use24HourClock) as usize - ptr as usize },
        514usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotStyle),
            "::",
            stringify!(Use24HourClock)
        )
    );
}
#[repr(C)]
#[derive(Clone, Copy, Debug)]
pub struct ImPlotInputMap {
    pub Pan: ImGuiMouseButton,
    pub PanMod: ::std::os::raw::c_int,
    pub Fit: ImGuiMouseButton,
    pub Select: ImGuiMouseButton,
    pub SelectCancel: ImGuiMouseButton,
    pub SelectMod: ::std::os::raw::c_int,
    pub SelectHorzMod: ::std::os::raw::c_int,
    pub SelectVertMod: ::std::os::raw::c_int,
    pub Menu: ImGuiMouseButton,
    pub OverrideMod: ::std::os::raw::c_int,
    pub ZoomMod: ::std::os::raw::c_int,
    pub ZoomRate: f32,
}
#[test]
fn bindgen_test_layout_ImPlotInputMap() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotInputMap> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotInputMap>(),
        48usize,
        concat!("Size of: ", stringify!(ImPlotInputMap))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotInputMap>(),
        4usize,
        concat!("Alignment of ", stringify!(ImPlotInputMap))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Pan) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotInputMap),
            "::",
            stringify!(Pan)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PanMod) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotInputMap),
            "::",
            stringify!(PanMod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Fit) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotInputMap),
            "::",
            stringify!(Fit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Select) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotInputMap),
            "::",
            stringify!(Select)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SelectCancel) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotInputMap),
            "::",
            stringify!(SelectCancel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SelectMod) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotInputMap),
            "::",
            stringify!(SelectMod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SelectHorzMod) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotInputMap),
            "::",
            stringify!(SelectHorzMod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SelectVertMod) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotInputMap),
            "::",
            stringify!(SelectVertMod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Menu) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotInputMap),
            "::",
            stringify!(Menu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OverrideMod) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotInputMap),
            "::",
            stringify!(OverrideMod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ZoomMod) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotInputMap),
            "::",
            stringify!(ZoomMod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ZoomRate) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotInputMap),
            "::",
            stringify!(ZoomRate)
        )
    );
}
pub type ImPlotFormatter = ::std::option::Option<
    unsafe extern "C" fn(
        value: f64,
        buff: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type ImPlotGetter = ::std::option::Option<
    unsafe extern "C" fn(
        idx: ::std::os::raw::c_int,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ImPlotPoint,
>;
pub type ImPlotTransform = ::std::option::Option<
    unsafe extern "C" fn(value: f64, user_data: *mut ::std::os::raw::c_void) -> f64,
>;
pub type ImPlotTimeUnit = ::std::os::raw::c_int;
pub type ImPlotDateFmt = ::std::os::raw::c_int;
pub type ImPlotTimeFmt = ::std::os::raw::c_int;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ImPlotTimeUnit_ {
    Us = 0,
    Ms = 1,
    S = 2,
    Min = 3,
    Hr = 4,
    Day = 5,
    Mo = 6,
    Yr = 7,
    COUNT = 8,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ImPlotDateFmt_ {
    None = 0,
    DayMo = 1,
    DayMoYr = 2,
    MoYr = 3,
    Mo = 4,
    Yr = 5,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ImPlotTimeFmt_ {
    None = 0,
    Us = 1,
    SUs = 2,
    SMs = 3,
    S = 4,
    MinSMs = 5,
    HrMinSMs = 6,
    HrMinS = 7,
    HrMin = 8,
    Hr = 9,
}
pub type ImPlotLocator = ::std::option::Option<
    unsafe extern "C" fn(
        ticker: *mut ImPlotTicker,
        range: ImPlotRange,
        pixels: f32,
        vertical: bool,
        formatter: ImPlotFormatter,
        formatter_data: *mut ::std::os::raw::c_void,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImPlotDateTimeSpec {
    pub Date: ImPlotDateFmt,
    pub Time: ImPlotTimeFmt,
    pub UseISO8601: bool,
    pub Use24HourClock: bool,
}
#[test]
fn bindgen_test_layout_ImPlotDateTimeSpec() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotDateTimeSpec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotDateTimeSpec>(),
        12usize,
        concat!("Size of: ", stringify!(ImPlotDateTimeSpec))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotDateTimeSpec>(),
        4usize,
        concat!("Alignment of ", stringify!(ImPlotDateTimeSpec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Date) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotDateTimeSpec),
            "::",
            stringify!(Date)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Time) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotDateTimeSpec),
            "::",
            stringify!(Time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UseISO8601) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotDateTimeSpec),
            "::",
            stringify!(UseISO8601)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Use24HourClock) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotDateTimeSpec),
            "::",
            stringify!(Use24HourClock)
        )
    );
}
#[repr(C)]
pub struct ImPlotTime {
    pub S: time_t,
    pub Us: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ImPlotTime() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotTime> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotTime>(),
        16usize,
        concat!("Size of: ", stringify!(ImPlotTime))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotTime>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotTime))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).S) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTime),
            "::",
            stringify!(S)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Us) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTime),
            "::",
            stringify!(Us)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_bool {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut bool,
}
#[test]
fn bindgen_test_layout_ImVector_bool() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_bool> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_bool>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_bool))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_bool>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_bool))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_bool),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_bool),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_bool),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
pub struct ImPlotColormapData {
    pub Keys: ImVector_ImU32,
    pub KeyCounts: ImVector_int,
    pub KeyOffsets: ImVector_int,
    pub Tables: ImVector_ImU32,
    pub TableSizes: ImVector_int,
    pub TableOffsets: ImVector_int,
    pub Text: ImGuiTextBuffer,
    pub TextOffsets: ImVector_int,
    pub Quals: ImVector_bool,
    pub Map: ImGuiStorage,
    pub Count: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ImPlotColormapData() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotColormapData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotColormapData>(),
        168usize,
        concat!("Size of: ", stringify!(ImPlotColormapData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotColormapData>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotColormapData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Keys) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotColormapData),
            "::",
            stringify!(Keys)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).KeyCounts) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotColormapData),
            "::",
            stringify!(KeyCounts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).KeyOffsets) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotColormapData),
            "::",
            stringify!(KeyOffsets)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Tables) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotColormapData),
            "::",
            stringify!(Tables)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TableSizes) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotColormapData),
            "::",
            stringify!(TableSizes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TableOffsets) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotColormapData),
            "::",
            stringify!(TableOffsets)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Text) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotColormapData),
            "::",
            stringify!(Text)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TextOffsets) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotColormapData),
            "::",
            stringify!(TextOffsets)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Quals) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotColormapData),
            "::",
            stringify!(Quals)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Map) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotColormapData),
            "::",
            stringify!(Map)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Count) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotColormapData),
            "::",
            stringify!(Count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImPlotPointError {
    pub X: f64,
    pub Y: f64,
    pub Neg: f64,
    pub Pos: f64,
}
#[test]
fn bindgen_test_layout_ImPlotPointError() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotPointError> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotPointError>(),
        32usize,
        concat!("Size of: ", stringify!(ImPlotPointError))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotPointError>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotPointError))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).X) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPointError),
            "::",
            stringify!(X)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPointError),
            "::",
            stringify!(Y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Neg) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPointError),
            "::",
            stringify!(Neg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Pos) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPointError),
            "::",
            stringify!(Pos)
        )
    );
}
#[repr(C)]
pub struct ImPlotAnnotation {
    pub Pos: ImVec2,
    pub Offset: ImVec2,
    pub ColorBg: ImU32,
    pub ColorFg: ImU32,
    pub TextOffset: ::std::os::raw::c_int,
    pub Clamp: bool,
}
#[test]
fn bindgen_test_layout_ImPlotAnnotation() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotAnnotation> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotAnnotation>(),
        32usize,
        concat!("Size of: ", stringify!(ImPlotAnnotation))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotAnnotation>(),
        4usize,
        concat!("Alignment of ", stringify!(ImPlotAnnotation))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAnnotation),
            "::",
            stringify!(Pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAnnotation),
            "::",
            stringify!(Offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorBg) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAnnotation),
            "::",
            stringify!(ColorBg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorFg) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAnnotation),
            "::",
            stringify!(ColorFg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TextOffset) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAnnotation),
            "::",
            stringify!(TextOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Clamp) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAnnotation),
            "::",
            stringify!(Clamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImPlotAnnotation {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImPlotAnnotation,
}
#[test]
fn bindgen_test_layout_ImVector_ImPlotAnnotation() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImPlotAnnotation> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImPlotAnnotation>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImPlotAnnotation))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImPlotAnnotation>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImPlotAnnotation))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotAnnotation),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotAnnotation),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotAnnotation),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
pub struct ImPlotAnnotationCollection {
    pub Annotations: ImVector_ImPlotAnnotation,
    pub TextBuffer: ImGuiTextBuffer,
    pub Size: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ImPlotAnnotationCollection() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotAnnotationCollection> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotAnnotationCollection>(),
        40usize,
        concat!("Size of: ", stringify!(ImPlotAnnotationCollection))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotAnnotationCollection>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotAnnotationCollection))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Annotations) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAnnotationCollection),
            "::",
            stringify!(Annotations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TextBuffer) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAnnotationCollection),
            "::",
            stringify!(TextBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAnnotationCollection),
            "::",
            stringify!(Size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImPlotTag {
    pub Axis: ImAxis,
    pub Value: f64,
    pub ColorBg: ImU32,
    pub ColorFg: ImU32,
    pub TextOffset: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ImPlotTag() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotTag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotTag>(),
        32usize,
        concat!("Size of: ", stringify!(ImPlotTag))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotTag>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotTag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Axis) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTag),
            "::",
            stringify!(Axis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTag),
            "::",
            stringify!(Value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorBg) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTag),
            "::",
            stringify!(ColorBg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorFg) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTag),
            "::",
            stringify!(ColorFg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TextOffset) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTag),
            "::",
            stringify!(TextOffset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImPlotTag {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImPlotTag,
}
#[test]
fn bindgen_test_layout_ImVector_ImPlotTag() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImPlotTag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImPlotTag>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImPlotTag))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImPlotTag>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImPlotTag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotTag),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotTag),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotTag),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
pub struct ImPlotTagCollection {
    pub Tags: ImVector_ImPlotTag,
    pub TextBuffer: ImGuiTextBuffer,
    pub Size: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ImPlotTagCollection() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotTagCollection> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotTagCollection>(),
        40usize,
        concat!("Size of: ", stringify!(ImPlotTagCollection))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotTagCollection>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotTagCollection))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Tags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTagCollection),
            "::",
            stringify!(Tags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TextBuffer) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTagCollection),
            "::",
            stringify!(TextBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTagCollection),
            "::",
            stringify!(Size)
        )
    );
}
#[repr(C)]
pub struct ImPlotTick {
    pub PlotPos: f64,
    pub PixelPos: f32,
    pub LabelSize: ImVec2,
    pub TextOffset: ::std::os::raw::c_int,
    pub Major: bool,
    pub ShowLabel: bool,
    pub Level: ::std::os::raw::c_int,
    pub Idx: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ImPlotTick() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotTick> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotTick>(),
        40usize,
        concat!("Size of: ", stringify!(ImPlotTick))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotTick>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotTick))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PlotPos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTick),
            "::",
            stringify!(PlotPos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PixelPos) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTick),
            "::",
            stringify!(PixelPos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LabelSize) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTick),
            "::",
            stringify!(LabelSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TextOffset) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTick),
            "::",
            stringify!(TextOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Major) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTick),
            "::",
            stringify!(Major)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ShowLabel) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTick),
            "::",
            stringify!(ShowLabel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Level) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTick),
            "::",
            stringify!(Level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Idx) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTick),
            "::",
            stringify!(Idx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImPlotTick {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImPlotTick,
}
#[test]
fn bindgen_test_layout_ImVector_ImPlotTick() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImPlotTick> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImPlotTick>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImPlotTick))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImPlotTick>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImPlotTick))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotTick),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotTick),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotTick),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
pub struct ImPlotTicker {
    pub Ticks: ImVector_ImPlotTick,
    pub TextBuffer: ImGuiTextBuffer,
    pub MaxSize: ImVec2,
    pub LateSize: ImVec2,
    pub Levels: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ImPlotTicker() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotTicker> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotTicker>(),
        56usize,
        concat!("Size of: ", stringify!(ImPlotTicker))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotTicker>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotTicker))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Ticks) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTicker),
            "::",
            stringify!(Ticks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TextBuffer) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTicker),
            "::",
            stringify!(TextBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MaxSize) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTicker),
            "::",
            stringify!(MaxSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LateSize) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTicker),
            "::",
            stringify!(LateSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Levels) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotTicker),
            "::",
            stringify!(Levels)
        )
    );
}
#[repr(C)]
pub struct ImPlotAxis {
    pub ID: ImGuiID,
    pub Flags: ImPlotAxisFlags,
    pub PreviousFlags: ImPlotAxisFlags,
    pub Range: ImPlotRange,
    pub RangeCond: ImPlotCond,
    pub Scale: ImPlotScale,
    pub FitExtents: ImPlotRange,
    pub OrthoAxis: *mut ImPlotAxis,
    pub ConstraintRange: ImPlotRange,
    pub ConstraintZoom: ImPlotRange,
    pub Ticker: ImPlotTicker,
    pub Formatter: ImPlotFormatter,
    pub FormatterData: *mut ::std::os::raw::c_void,
    pub FormatSpec: [::std::os::raw::c_char; 16usize],
    pub Locator: ImPlotLocator,
    pub LinkedMin: *mut f64,
    pub LinkedMax: *mut f64,
    pub PickerLevel: ::std::os::raw::c_int,
    pub PickerTimeMin: ImPlotTime,
    pub PickerTimeMax: ImPlotTime,
    pub TransformForward: ImPlotTransform,
    pub TransformInverse: ImPlotTransform,
    pub TransformData: *mut ::std::os::raw::c_void,
    pub PixelMin: f32,
    pub PixelMax: f32,
    pub ScaleMin: f64,
    pub ScaleMax: f64,
    pub ScaleToPixel: f64,
    pub Datum1: f32,
    pub Datum2: f32,
    pub HoverRect: ImRect,
    pub LabelOffset: ::std::os::raw::c_int,
    pub ColorMaj: ImU32,
    pub ColorMin: ImU32,
    pub ColorTick: ImU32,
    pub ColorTxt: ImU32,
    pub ColorBg: ImU32,
    pub ColorHov: ImU32,
    pub ColorAct: ImU32,
    pub ColorHiLi: ImU32,
    pub Enabled: bool,
    pub Vertical: bool,
    pub FitThisFrame: bool,
    pub HasRange: bool,
    pub HasFormatSpec: bool,
    pub ShowDefaultTicks: bool,
    pub Hovered: bool,
    pub Held: bool,
}
#[test]
fn bindgen_test_layout_ImPlotAxis() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotAxis> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotAxis>(),
        376usize,
        concat!("Size of: ", stringify!(ImPlotAxis))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotAxis>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotAxis))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(ID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(Flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreviousFlags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(PreviousFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Range) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(Range)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RangeCond) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(RangeCond)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Scale) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(Scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FitExtents) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(FitExtents)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OrthoAxis) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(OrthoAxis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ConstraintRange) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(ConstraintRange)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ConstraintZoom) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(ConstraintZoom)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Ticker) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(Ticker)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Formatter) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(Formatter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FormatterData) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(FormatterData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FormatSpec) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(FormatSpec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Locator) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(Locator)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LinkedMin) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(LinkedMin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LinkedMax) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(LinkedMax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PickerLevel) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(PickerLevel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PickerTimeMin) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(PickerTimeMin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PickerTimeMax) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(PickerTimeMax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TransformForward) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(TransformForward)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TransformInverse) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(TransformInverse)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TransformData) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(TransformData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PixelMin) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(PixelMin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PixelMax) as usize - ptr as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(PixelMax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ScaleMin) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(ScaleMin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ScaleMax) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(ScaleMax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ScaleToPixel) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(ScaleToPixel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Datum1) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(Datum1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Datum2) as usize - ptr as usize },
        308usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(Datum2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HoverRect) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(HoverRect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LabelOffset) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(LabelOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorMaj) as usize - ptr as usize },
        332usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(ColorMaj)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorMin) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(ColorMin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorTick) as usize - ptr as usize },
        340usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(ColorTick)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorTxt) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(ColorTxt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorBg) as usize - ptr as usize },
        348usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(ColorBg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorHov) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(ColorHov)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorAct) as usize - ptr as usize },
        356usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(ColorAct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorHiLi) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(ColorHiLi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Enabled) as usize - ptr as usize },
        364usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(Enabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Vertical) as usize - ptr as usize },
        365usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(Vertical)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FitThisFrame) as usize - ptr as usize },
        366usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(FitThisFrame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HasRange) as usize - ptr as usize },
        367usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(HasRange)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HasFormatSpec) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(HasFormatSpec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ShowDefaultTicks) as usize - ptr as usize },
        369usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(ShowDefaultTicks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Hovered) as usize - ptr as usize },
        370usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(Hovered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Held) as usize - ptr as usize },
        371usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAxis),
            "::",
            stringify!(Held)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImPlotAlignmentData {
    pub Vertical: bool,
    pub PadA: f32,
    pub PadB: f32,
    pub PadAMax: f32,
    pub PadBMax: f32,
}
#[test]
fn bindgen_test_layout_ImPlotAlignmentData() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotAlignmentData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotAlignmentData>(),
        20usize,
        concat!("Size of: ", stringify!(ImPlotAlignmentData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotAlignmentData>(),
        4usize,
        concat!("Alignment of ", stringify!(ImPlotAlignmentData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Vertical) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAlignmentData),
            "::",
            stringify!(Vertical)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PadA) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAlignmentData),
            "::",
            stringify!(PadA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PadB) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAlignmentData),
            "::",
            stringify!(PadB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PadAMax) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAlignmentData),
            "::",
            stringify!(PadAMax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PadBMax) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotAlignmentData),
            "::",
            stringify!(PadBMax)
        )
    );
}
#[repr(C)]
pub struct ImPlotItem {
    pub ID: ImGuiID,
    pub Color: ImU32,
    pub LegendHoverRect: ImRect,
    pub NameOffset: ::std::os::raw::c_int,
    pub Show: bool,
    pub LegendHovered: bool,
    pub SeenThisFrame: bool,
}
#[test]
fn bindgen_test_layout_ImPlotItem() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotItem> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotItem>(),
        32usize,
        concat!("Size of: ", stringify!(ImPlotItem))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotItem>(),
        4usize,
        concat!("Alignment of ", stringify!(ImPlotItem))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotItem),
            "::",
            stringify!(ID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Color) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotItem),
            "::",
            stringify!(Color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LegendHoverRect) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotItem),
            "::",
            stringify!(LegendHoverRect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NameOffset) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotItem),
            "::",
            stringify!(NameOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Show) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotItem),
            "::",
            stringify!(Show)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LegendHovered) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotItem),
            "::",
            stringify!(LegendHovered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SeenThisFrame) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotItem),
            "::",
            stringify!(SeenThisFrame)
        )
    );
}
#[repr(C)]
pub struct ImPlotLegend {
    pub Flags: ImPlotLegendFlags,
    pub PreviousFlags: ImPlotLegendFlags,
    pub Location: ImPlotLocation,
    pub PreviousLocation: ImPlotLocation,
    pub Scroll: ImVec2,
    pub Indices: ImVector_int,
    pub Labels: ImGuiTextBuffer,
    pub Rect: ImRect,
    pub RectClamped: ImRect,
    pub Hovered: bool,
    pub Held: bool,
    pub CanGoInside: bool,
}
#[test]
fn bindgen_test_layout_ImPlotLegend() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotLegend> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotLegend>(),
        96usize,
        concat!("Size of: ", stringify!(ImPlotLegend))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotLegend>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotLegend))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotLegend),
            "::",
            stringify!(Flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreviousFlags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotLegend),
            "::",
            stringify!(PreviousFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Location) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotLegend),
            "::",
            stringify!(Location)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreviousLocation) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotLegend),
            "::",
            stringify!(PreviousLocation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Scroll) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotLegend),
            "::",
            stringify!(Scroll)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Indices) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotLegend),
            "::",
            stringify!(Indices)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Labels) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotLegend),
            "::",
            stringify!(Labels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Rect) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotLegend),
            "::",
            stringify!(Rect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RectClamped) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotLegend),
            "::",
            stringify!(RectClamped)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Hovered) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotLegend),
            "::",
            stringify!(Hovered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Held) as usize - ptr as usize },
        89usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotLegend),
            "::",
            stringify!(Held)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CanGoInside) as usize - ptr as usize },
        90usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotLegend),
            "::",
            stringify!(CanGoInside)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImPlotItem {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImPlotItem,
}
#[test]
fn bindgen_test_layout_ImVector_ImPlotItem() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImPlotItem> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImPlotItem>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImPlotItem))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImPlotItem>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImPlotItem))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotItem),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotItem),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotItem),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
pub struct ImPool_ImPlotItem {
    pub Buf: ImVector_ImPlotItem,
    pub Map: ImGuiStorage,
    pub FreeIdx: ImPoolIdx,
    pub AliveCount: ImPoolIdx,
}
#[test]
fn bindgen_test_layout_ImPool_ImPlotItem() {
    const UNINIT: ::std::mem::MaybeUninit<ImPool_ImPlotItem> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPool_ImPlotItem>(),
        40usize,
        concat!("Size of: ", stringify!(ImPool_ImPlotItem))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPool_ImPlotItem>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPool_ImPlotItem))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Buf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotItem),
            "::",
            stringify!(Buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Map) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotItem),
            "::",
            stringify!(Map)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FreeIdx) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotItem),
            "::",
            stringify!(FreeIdx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AliveCount) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotItem),
            "::",
            stringify!(AliveCount)
        )
    );
}
#[repr(C)]
pub struct ImPlotItemGroup {
    pub ID: ImGuiID,
    pub Legend: ImPlotLegend,
    pub ItemPool: ImPool_ImPlotItem,
    pub ColormapIdx: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ImPlotItemGroup() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotItemGroup> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotItemGroup>(),
        152usize,
        concat!("Size of: ", stringify!(ImPlotItemGroup))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotItemGroup>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotItemGroup))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotItemGroup),
            "::",
            stringify!(ID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Legend) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotItemGroup),
            "::",
            stringify!(Legend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ItemPool) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotItemGroup),
            "::",
            stringify!(ItemPool)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColormapIdx) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotItemGroup),
            "::",
            stringify!(ColormapIdx)
        )
    );
}
#[repr(C)]
pub struct ImPlotPlot {
    pub ID: ImGuiID,
    pub Flags: ImPlotFlags,
    pub PreviousFlags: ImPlotFlags,
    pub MouseTextLocation: ImPlotLocation,
    pub MouseTextFlags: ImPlotMouseTextFlags,
    pub Axes: [ImPlotAxis; 6usize],
    pub TextBuffer: ImGuiTextBuffer,
    pub Items: ImPlotItemGroup,
    pub CurrentX: ImAxis,
    pub CurrentY: ImAxis,
    pub FrameRect: ImRect,
    pub CanvasRect: ImRect,
    pub PlotRect: ImRect,
    pub AxesRect: ImRect,
    pub SelectRect: ImRect,
    pub SelectStart: ImVec2,
    pub TitleOffset: ::std::os::raw::c_int,
    pub JustCreated: bool,
    pub Initialized: bool,
    pub SetupLocked: bool,
    pub FitThisFrame: bool,
    pub Hovered: bool,
    pub Held: bool,
    pub Selecting: bool,
    pub Selected: bool,
    pub ContextLocked: bool,
}
#[test]
fn bindgen_test_layout_ImPlotPlot() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotPlot> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotPlot>(),
        2560usize,
        concat!("Size of: ", stringify!(ImPlotPlot))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotPlot>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotPlot))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(ID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(Flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreviousFlags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(PreviousFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MouseTextLocation) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(MouseTextLocation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MouseTextFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(MouseTextFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Axes) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(Axes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TextBuffer) as usize - ptr as usize },
        2280usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(TextBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Items) as usize - ptr as usize },
        2296usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(Items)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentX) as usize - ptr as usize },
        2448usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(CurrentX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentY) as usize - ptr as usize },
        2452usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(CurrentY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrameRect) as usize - ptr as usize },
        2456usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(FrameRect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CanvasRect) as usize - ptr as usize },
        2472usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(CanvasRect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PlotRect) as usize - ptr as usize },
        2488usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(PlotRect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AxesRect) as usize - ptr as usize },
        2504usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(AxesRect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SelectRect) as usize - ptr as usize },
        2520usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(SelectRect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SelectStart) as usize - ptr as usize },
        2536usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(SelectStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TitleOffset) as usize - ptr as usize },
        2544usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(TitleOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).JustCreated) as usize - ptr as usize },
        2548usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(JustCreated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Initialized) as usize - ptr as usize },
        2549usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(Initialized)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetupLocked) as usize - ptr as usize },
        2550usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(SetupLocked)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FitThisFrame) as usize - ptr as usize },
        2551usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(FitThisFrame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Hovered) as usize - ptr as usize },
        2552usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(Hovered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Held) as usize - ptr as usize },
        2553usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(Held)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Selecting) as usize - ptr as usize },
        2554usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(Selecting)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Selected) as usize - ptr as usize },
        2555usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(Selected)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ContextLocked) as usize - ptr as usize },
        2556usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotPlot),
            "::",
            stringify!(ContextLocked)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImPlotAlignmentData {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImPlotAlignmentData,
}
#[test]
fn bindgen_test_layout_ImVector_ImPlotAlignmentData() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImPlotAlignmentData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImPlotAlignmentData>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImPlotAlignmentData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImPlotAlignmentData>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImPlotAlignmentData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotAlignmentData),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotAlignmentData),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotAlignmentData),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImPlotRange {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImPlotRange,
}
#[test]
fn bindgen_test_layout_ImVector_ImPlotRange() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImPlotRange> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImPlotRange>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImPlotRange))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImPlotRange>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImPlotRange))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotRange),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotRange),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotRange),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
pub struct ImPlotSubplot {
    pub ID: ImGuiID,
    pub Flags: ImPlotSubplotFlags,
    pub PreviousFlags: ImPlotSubplotFlags,
    pub Items: ImPlotItemGroup,
    pub Rows: ::std::os::raw::c_int,
    pub Cols: ::std::os::raw::c_int,
    pub CurrentIdx: ::std::os::raw::c_int,
    pub FrameRect: ImRect,
    pub GridRect: ImRect,
    pub CellSize: ImVec2,
    pub RowAlignmentData: ImVector_ImPlotAlignmentData,
    pub ColAlignmentData: ImVector_ImPlotAlignmentData,
    pub RowRatios: ImVector_float,
    pub ColRatios: ImVector_float,
    pub RowLinkData: ImVector_ImPlotRange,
    pub ColLinkData: ImVector_ImPlotRange,
    pub TempSizes: [f32; 2usize],
    pub FrameHovered: bool,
    pub HasTitle: bool,
}
#[test]
fn bindgen_test_layout_ImPlotSubplot() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotSubplot> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotSubplot>(),
        336usize,
        concat!("Size of: ", stringify!(ImPlotSubplot))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotSubplot>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotSubplot))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(ID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(Flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreviousFlags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(PreviousFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Items) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(Items)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Rows) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(Rows)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Cols) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(Cols)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentIdx) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(CurrentIdx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrameRect) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(FrameRect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GridRect) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(GridRect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CellSize) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(CellSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RowAlignmentData) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(RowAlignmentData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColAlignmentData) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(ColAlignmentData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RowRatios) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(RowRatios)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColRatios) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(ColRatios)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RowLinkData) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(RowLinkData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColLinkData) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(ColLinkData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TempSizes) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(TempSizes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FrameHovered) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(FrameHovered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HasTitle) as usize - ptr as usize },
        329usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotSubplot),
            "::",
            stringify!(HasTitle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImPlotNextPlotData {
    pub RangeCond: [ImPlotCond; 6usize],
    pub Range: [ImPlotRange; 6usize],
    pub HasRange: [bool; 6usize],
    pub Fit: [bool; 6usize],
    pub LinkedMin: [*mut f64; 6usize],
    pub LinkedMax: [*mut f64; 6usize],
}
#[test]
fn bindgen_test_layout_ImPlotNextPlotData() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotNextPlotData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotNextPlotData>(),
        232usize,
        concat!("Size of: ", stringify!(ImPlotNextPlotData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotNextPlotData>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotNextPlotData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RangeCond) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextPlotData),
            "::",
            stringify!(RangeCond)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Range) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextPlotData),
            "::",
            stringify!(Range)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HasRange) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextPlotData),
            "::",
            stringify!(HasRange)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Fit) as usize - ptr as usize },
        126usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextPlotData),
            "::",
            stringify!(Fit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LinkedMin) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextPlotData),
            "::",
            stringify!(LinkedMin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LinkedMax) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextPlotData),
            "::",
            stringify!(LinkedMax)
        )
    );
}
#[repr(C)]
pub struct ImPlotNextItemData {
    pub Colors: [ImVec4; 5usize],
    pub LineWeight: f32,
    pub Marker: ImPlotMarker,
    pub MarkerSize: f32,
    pub MarkerWeight: f32,
    pub FillAlpha: f32,
    pub ErrorBarSize: f32,
    pub ErrorBarWeight: f32,
    pub DigitalBitHeight: f32,
    pub DigitalBitGap: f32,
    pub RenderLine: bool,
    pub RenderFill: bool,
    pub RenderMarkerLine: bool,
    pub RenderMarkerFill: bool,
    pub HasHidden: bool,
    pub Hidden: bool,
    pub HiddenCond: ImPlotCond,
}
#[test]
fn bindgen_test_layout_ImPlotNextItemData() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotNextItemData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotNextItemData>(),
        128usize,
        concat!("Size of: ", stringify!(ImPlotNextItemData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotNextItemData>(),
        4usize,
        concat!("Alignment of ", stringify!(ImPlotNextItemData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Colors) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(Colors)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LineWeight) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(LineWeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Marker) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(Marker)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MarkerSize) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(MarkerSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MarkerWeight) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(MarkerWeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FillAlpha) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(FillAlpha)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ErrorBarSize) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(ErrorBarSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ErrorBarWeight) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(ErrorBarWeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DigitalBitHeight) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(DigitalBitHeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DigitalBitGap) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(DigitalBitGap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RenderLine) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(RenderLine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RenderFill) as usize - ptr as usize },
        117usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(RenderFill)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RenderMarkerLine) as usize - ptr as usize },
        118usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(RenderMarkerLine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RenderMarkerFill) as usize - ptr as usize },
        119usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(RenderMarkerFill)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HasHidden) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(HasHidden)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Hidden) as usize - ptr as usize },
        121usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(Hidden)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HiddenCond) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotNextItemData),
            "::",
            stringify!(HiddenCond)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImPlotPlot {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImPlotPlot,
}
#[test]
fn bindgen_test_layout_ImVector_ImPlotPlot() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImPlotPlot> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImPlotPlot>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImPlotPlot))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImPlotPlot>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImPlotPlot))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotPlot),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotPlot),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotPlot),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
pub struct ImPool_ImPlotPlot {
    pub Buf: ImVector_ImPlotPlot,
    pub Map: ImGuiStorage,
    pub FreeIdx: ImPoolIdx,
    pub AliveCount: ImPoolIdx,
}
#[test]
fn bindgen_test_layout_ImPool_ImPlotPlot() {
    const UNINIT: ::std::mem::MaybeUninit<ImPool_ImPlotPlot> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPool_ImPlotPlot>(),
        40usize,
        concat!("Size of: ", stringify!(ImPool_ImPlotPlot))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPool_ImPlotPlot>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPool_ImPlotPlot))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Buf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotPlot),
            "::",
            stringify!(Buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Map) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotPlot),
            "::",
            stringify!(Map)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FreeIdx) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotPlot),
            "::",
            stringify!(FreeIdx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AliveCount) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotPlot),
            "::",
            stringify!(AliveCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImPlotSubplot {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImPlotSubplot,
}
#[test]
fn bindgen_test_layout_ImVector_ImPlotSubplot() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImPlotSubplot> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImPlotSubplot>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImPlotSubplot))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImPlotSubplot>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImPlotSubplot))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotSubplot),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotSubplot),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotSubplot),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
pub struct ImPool_ImPlotSubplot {
    pub Buf: ImVector_ImPlotSubplot,
    pub Map: ImGuiStorage,
    pub FreeIdx: ImPoolIdx,
    pub AliveCount: ImPoolIdx,
}
#[test]
fn bindgen_test_layout_ImPool_ImPlotSubplot() {
    const UNINIT: ::std::mem::MaybeUninit<ImPool_ImPlotSubplot> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPool_ImPlotSubplot>(),
        40usize,
        concat!("Size of: ", stringify!(ImPool_ImPlotSubplot))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPool_ImPlotSubplot>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPool_ImPlotSubplot))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Buf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotSubplot),
            "::",
            stringify!(Buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Map) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotSubplot),
            "::",
            stringify!(Map)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FreeIdx) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotSubplot),
            "::",
            stringify!(FreeIdx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AliveCount) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotSubplot),
            "::",
            stringify!(AliveCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_ImPlotColormap {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut ImPlotColormap,
}
#[test]
fn bindgen_test_layout_ImVector_ImPlotColormap() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_ImPlotColormap> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_ImPlotColormap>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_ImPlotColormap))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_ImPlotColormap>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_ImPlotColormap))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotColormap),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotColormap),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_ImPlotColormap),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImVector_double {
    pub Size: ::std::os::raw::c_int,
    pub Capacity: ::std::os::raw::c_int,
    pub Data: *mut f64,
}
#[test]
fn bindgen_test_layout_ImVector_double() {
    const UNINIT: ::std::mem::MaybeUninit<ImVector_double> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImVector_double>(),
        16usize,
        concat!("Size of: ", stringify!(ImVector_double))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVector_double>(),
        8usize,
        concat!("Alignment of ", stringify!(ImVector_double))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_double),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Capacity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_double),
            "::",
            stringify!(Capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVector_double),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
pub struct ImPool_ImPlotAlignmentData {
    pub Buf: ImVector_ImPlotAlignmentData,
    pub Map: ImGuiStorage,
    pub FreeIdx: ImPoolIdx,
    pub AliveCount: ImPoolIdx,
}
#[test]
fn bindgen_test_layout_ImPool_ImPlotAlignmentData() {
    const UNINIT: ::std::mem::MaybeUninit<ImPool_ImPlotAlignmentData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPool_ImPlotAlignmentData>(),
        40usize,
        concat!("Size of: ", stringify!(ImPool_ImPlotAlignmentData))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPool_ImPlotAlignmentData>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPool_ImPlotAlignmentData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Buf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotAlignmentData),
            "::",
            stringify!(Buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Map) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotAlignmentData),
            "::",
            stringify!(Map)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FreeIdx) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotAlignmentData),
            "::",
            stringify!(FreeIdx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AliveCount) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPool_ImPlotAlignmentData),
            "::",
            stringify!(AliveCount)
        )
    );
}
#[repr(C)]
pub struct ImPlotContext {
    pub Plots: ImPool_ImPlotPlot,
    pub Subplots: ImPool_ImPlotSubplot,
    pub CurrentPlot: *mut ImPlotPlot,
    pub CurrentSubplot: *mut ImPlotSubplot,
    pub CurrentItems: *mut ImPlotItemGroup,
    pub CurrentItem: *mut ImPlotItem,
    pub PreviousItem: *mut ImPlotItem,
    pub CTicker: ImPlotTicker,
    pub Annotations: ImPlotAnnotationCollection,
    pub Tags: ImPlotTagCollection,
    pub Style: ImPlotStyle,
    pub ColorModifiers: ImVector_ImGuiColorMod,
    pub StyleModifiers: ImVector_ImGuiStyleMod,
    pub ColormapData: ImPlotColormapData,
    pub ColormapModifiers: ImVector_ImPlotColormap,
    pub Tm: tm,
    pub TempDouble1: ImVector_double,
    pub TempDouble2: ImVector_double,
    pub TempInt1: ImVector_int,
    pub DigitalPlotItemCnt: ::std::os::raw::c_int,
    pub DigitalPlotOffset: ::std::os::raw::c_int,
    pub NextPlotData: ImPlotNextPlotData,
    pub NextItemData: ImPlotNextItemData,
    pub InputMap: ImPlotInputMap,
    pub OpenContextThisFrame: bool,
    pub MousePosStringBuilder: ImGuiTextBuffer,
    pub SortItems: *mut ImPlotItemGroup,
    pub AlignmentData: ImPool_ImPlotAlignmentData,
    pub CurrentAlignmentH: *mut ImPlotAlignmentData,
    pub CurrentAlignmentV: *mut ImPlotAlignmentData,
}
#[test]
fn bindgen_test_layout_ImPlotContext() {
    const UNINIT: ::std::mem::MaybeUninit<ImPlotContext> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ImPlotContext>(),
        1600usize,
        concat!("Size of: ", stringify!(ImPlotContext))
    );
    assert_eq!(
        ::std::mem::align_of::<ImPlotContext>(),
        8usize,
        concat!("Alignment of ", stringify!(ImPlotContext))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Plots) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(Plots)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Subplots) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(Subplots)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentPlot) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(CurrentPlot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentSubplot) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(CurrentSubplot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentItems) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(CurrentItems)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentItem) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(CurrentItem)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PreviousItem) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(PreviousItem)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CTicker) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(CTicker)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Annotations) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(Annotations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Tags) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(Tags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Style) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(Style)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColorModifiers) as usize - ptr as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(ColorModifiers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).StyleModifiers) as usize - ptr as usize },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(StyleModifiers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColormapData) as usize - ptr as usize },
        808usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(ColormapData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ColormapModifiers) as usize - ptr as usize },
        976usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(ColormapModifiers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Tm) as usize - ptr as usize },
        992usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(Tm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TempDouble1) as usize - ptr as usize },
        1048usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(TempDouble1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TempDouble2) as usize - ptr as usize },
        1064usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(TempDouble2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TempInt1) as usize - ptr as usize },
        1080usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(TempInt1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DigitalPlotItemCnt) as usize - ptr as usize },
        1096usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(DigitalPlotItemCnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DigitalPlotOffset) as usize - ptr as usize },
        1100usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(DigitalPlotOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NextPlotData) as usize - ptr as usize },
        1104usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(NextPlotData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NextItemData) as usize - ptr as usize },
        1336usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(NextItemData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InputMap) as usize - ptr as usize },
        1464usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(InputMap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OpenContextThisFrame) as usize - ptr as usize },
        1512usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(OpenContextThisFrame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MousePosStringBuilder) as usize - ptr as usize },
        1520usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(MousePosStringBuilder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SortItems) as usize - ptr as usize },
        1536usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(SortItems)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AlignmentData) as usize - ptr as usize },
        1544usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(AlignmentData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentAlignmentH) as usize - ptr as usize },
        1584usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(CurrentAlignmentH)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CurrentAlignmentV) as usize - ptr as usize },
        1592usize,
        concat!(
            "Offset of field: ",
            stringify!(ImPlotContext),
            "::",
            stringify!(CurrentAlignmentV)
        )
    );
}
pub type ImPlotPoint_getter = ::std::option::Option<
    unsafe extern "C" fn(
        data: *mut ::std::os::raw::c_void,
        idx: ::std::os::raw::c_int,
        point: *mut ImPlotPoint,
    ) -> *mut ::std::os::raw::c_void,
>;
extern "C" {
    pub fn ImPlotPoint_ImPlotPoint_Nil() -> *mut ImPlotPoint;
}
extern "C" {
    pub fn ImPlotPoint_destroy(self_: *mut ImPlotPoint);
}
extern "C" {
    pub fn ImPlotPoint_ImPlotPoint_double(_x: f64, _y: f64) -> *mut ImPlotPoint;
}
extern "C" {
    pub fn ImPlotPoint_ImPlotPoint_Vec2(p: ImVec2) -> *mut ImPlotPoint;
}
extern "C" {
    pub fn ImPlotRange_ImPlotRange_Nil() -> *mut ImPlotRange;
}
extern "C" {
    pub fn ImPlotRange_destroy(self_: *mut ImPlotRange);
}
extern "C" {
    pub fn ImPlotRange_ImPlotRange_double(_min: f64, _max: f64) -> *mut ImPlotRange;
}
extern "C" {
